      ******************************************************************
      * Author: JEFFERSON RIZZETTO
      * Date: 11/06/2025
      * Porpose: APRENDER COBOL  
      * Tectonics: cobc
      ******************************************************************
       
       IDENTIFICATION DIVISION. 
       PROGRAM-ID. YOUR-PROGRAM.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION. 
       PROCEDURE DIVISION.
            DISPLAY "Hello World"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM.